# ServiceAbbreviation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..ServiceAbbreviation Property
FabricationPart Class See Also
---
The associated service abbreviation for the fabrication service.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public string ServiceAbbreviation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ServiceAbbreviation As String
	Get
```

Visual C++
---
```text
public:
property String^ ServiceAbbreviation {
	String^ get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace